package com.alphabetas.bot.caller.command;

import com.alphabetas.bot.caller.model.CallerChat;
import com.alphabetas.bot.caller.model.CallerUser;
import lombok.NoArgsConstructor;
import lombok.extern.slf4j.Slf4j;
import org.telegram.telegrambots.meta.api.objects.Update;

import java.util.Random;

@NoArgsConstructor
@Slf4j
public class TipCommand extends Command {

    public TipCommand(String msgText, CallerChat chat, CallerUser user, Integer threadId) {
        super(msgText, chat, user, threadId);
    }

    private static final String[] helpMessages = new String[]{"З часом підказок стане більше, а поки що є що є",
            "Я не придумав що тут написати, тому якщо будуть ідеї то пишіть",
            "Щоб додати ім'я достатньо написати Кликун додай або /add",
            "Подивитися свої імена можна командою Кликун покажи/шов або /show",
            "Якщо ви передумали додавати ім'я напишіть /cancel",
            "Не подобається ваше ім'я? Його можна видалити командою Кликун видали або /delete",
            "Кликуна можна налаштувати командою /config. (Налаштовувати може <u>тільки власник групи</u>)",
            "Кликун старається перейняти найкраще з інших ботів, тому вже є рольові команди, як альтернатива роснявому ірісу",
            "В налаштуваннях Кликуна можна змінити ліміт на кількість імен, включити чи виключити рольові команди, тощо",
            "Адміністратори групи можуть додавати та видаляти імена іншим. Для цього напишіть команду !Кликун додай/видали у відповідь на повідомлення іншої людини",
            "Кожен може подивитися імена інших. Просто напишіть Кликун покажи/шов або /show у відповідь на повідомлення іншої людини",
            "Кликун не любить коли відмічають інших через собачку, але це можна виключити в налаштуваннях Кликуна",
            "Легко перевірити чи працює зараз Кликун можна написавши \"Кликун\". Хто зна, може в цьому є якась пасхалка?",
            "<s>Не</s>повний перелік рольових команд можна знайти <a href='https://t.me/callerHut/19'><u>туть</u></a>",
            "По замовчуванню пробіли в іменах заборонені, але це можна змінити в налаштуваннях Кликуна",
            "Якщо є ідеї по Кликуну, то їх можна написати <a href='https://t.me/callerHutChat'><u>сюди</u></a> з хештегом #ідея",
            "Сподобався Кликун? Порекомендуйте його друзям, мені буде приємно \uD83E\uDD79",
            "Якщо ви не знаєте, що таке групові імена, то почитайте <a href='https://t.me/callerHut/19'><u>туть</u></a>. Зручна штука, рекомендую",
            "Створювати та видаляти групові імена можуть тільки адміністратори",
            "Групові імена зручні, коли потрібно покликати певну групу людей, наприклад тих, хто любить частенько грати в мафію",
            "Щоб звернутися до Кликуна не обов'язково писати \"Кликун додати\", можна просто почати повідомлення з точки: .додати",
            "Коротко про Кликуна та його функції можна прочитати <a href='https://t.me/callerHut/5'><u>туть</u></a>",
            "Підпишіться на <a href='https://t.me/callerHut/5'><u>Хатину Кликуна</u></a>, щоб не пропускати оновлення Кликуна",
            "Кликати можна декілька людей в одному повідомленню, це також працює",
            "Якщо ви бачете відповідь \"Ім'я x не може бути додано через через заборонені символи\", то перевірте правильність імені, можливо в ньому є пробіли, або ви ввели команду неправильно)"
    };


    @Override
    public void execute(Update update) {
        log.info("Entered into HelpCommand");

        String helpMessage = helpMessages[new Random().nextInt(helpMessages.length)];

        messageService.sendMessage(chat.getId(), helpMessage, threadId);
        messageService.sendMessage(731921794L, "Використана підказка в чаті " + chat.getTitle(), (Integer) null);
    }

    @Override
    public String[] getSpecialArgs() {
        return new String[]{"/tip", "допоможи", "підказка", "як", "дай підказку"};
    }
}
